[{"name": "Academic City University College", "ranking": "34", "website": "https://acity.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/18483.png", "description": "Founded in 2009,  Academic City University College is a for-profit private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Academic City University College (ACity Ghana) is a very small (uniRank enrollment range: 500-999 students) coeducational Ghanaian higher education institution. Academic City University College (ACity Ghana) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 13 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades.  The admission rate range is 40-50% making this Ghanaian higher education organization a averagely selective institution. International students are welcome to apply for enrollment.  ACity Ghana also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "ACity Ghana", "founded": "2009 ", "motto": "Academic Excellence ", "colors": "Red, grey and white", "address": "Property # 279-302, Agbogba, Haatso, P.O. Box AD 421 Accra  AD 421 Greater Accra Ghana", "tel": " +233 554 264 486", "fax": " +233 "}, {"name": "Accra Institute of Technology", "ranking": "30", "website": "https://www.ait.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/14960.png", "description": "Established in 2009,  Accra Institute of Technology is a non-profit private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Accra Institute of Technology (AIT) is a small (uniRank enrollment range: 2,000-2,999 students) coeducational Ghanaian higher education institution. Accra Institute of Technology (AIT) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 13 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades.  The admission rate range is 70-80% making this Ghanaian higher education organization a somewhat selective institution. International applicants are eligible to apply for enrollment.  AIT also provides several academic and non-academic facilities and services to students including a library,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "AIT", "founded": "2009 ", "motto": "University of The Future ", "colors": "Blue and white", "address": "Ga West Accra  AN-19782 Greater Accra Ghana", "tel": " +233 (302) 786 022", "fax": " +233 "}, {"name": "Accra Technical University", "ranking": "13", "website": "https://atu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/10305.png", "description": "Founded in 1949,  Accra Technical University is a non-profit public higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Accra Technical University (ATU) is a coeducational Ghanaian higher education institution. Accra Technical University (ATU) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. International students are welcome to apply for enrollment.  ATU also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "ATU", "founded": "1949 ", "motto": "Truth Excellence Service ", "colors": "\n\n ", "address": "PO Box 561; Barnes road Accra   Greater Accra Ghana", "tel": " +233 (30) 268 9279", "fax": " +233 (21) 664 797"}, {"name": "Advanced Business College", "ranking": "64", "website": "https://advancedbusinesscollege.org", "logo": "https://www.4icu.org/i/logos-seals/13996.png", "description": "Established in 2005,  Advanced Business College is a for-profit private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Advanced Business College (ABC) is a very small (uniRank enrollment range: under-250 students) coeducational Ghanaian higher education institution. Advanced Business College (ABC) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 17 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades.  The admission rate range is 90-100% making this Ghanaian higher education organization a least selective institution. International applicants are eligible to apply for enrollment.  ABC also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "ABC", "founded": "2005 ", "motto": "Star of Excellence ", "colors": "Red, blue and white", "address": "3rd Darko Lane, North Kaneshie Point 4, B435/21 Anuwaatre Street Accra   Greater Accra Ghana", "tel": " +233 (302) 224 8667/8", "fax": " +233 (302) 255 737"}, {"name": "African University College of Communications", "ranking": "35", "website": "https://www.aucc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13992.png", "description": "Established in 2001,  African University College of Communications is a  private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the Ministry of Education of Ghana, African University College of Communications (AUCC) is a coeducational Ghanaian higher education institution. African University College of Communications (AUCC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  AUCC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "AUCC", "founded": "2001 ", "motto": "Discover Yourself From Here ", "colors": "\n\n ", "address": "PO Box LG 510; Adabraka Accra   Greater Accra Ghana", "tel": " +233 (302) 258 584", "fax": " +233 (302) 701 1526"}, {"name": "All Nations University", "ranking": "9", "website": "https://anu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11135.png", "description": "Founded in 1996,  All Nations University is a non-profit private higher-education institution located in the suburban setting of the small city of Koforidua (population range of 50,000-249,999 inhabitants), Eastern Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), All Nations University (ANU) is a small (uniRank enrollment range: 3,000-3,999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Nondenominational religion. All Nations University (ANU) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 26 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  The admission rate range is 70-80% making this Ghanaian higher education organization a somewhat selective institution. International students are welcome to apply for enrollment.  ANU also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  as well as administrative services.", "acronym": "ANU", "founded": "1996 ", "motto": "Equipped for Every Good Work ", "colors": "Red, yellow, green and black", "address": "97 N.K. Boateng KF1908 Koforidua   Eastern Region Ghana", "tel": " +233 20 160 0855", "fax": " +233 "}, {"name": "Anglican University College of Technology", "ranking": "46", "website": "https://www.angutech.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/14961.png", "description": " Anglican University College of Technology is a  private higher-education institution located in the small city of Teshie (population range of 50,000-249,999 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Anglican University College of Technology (ANG.U.TECH) is a coeducational Ghanaian higher education institution. Anglican University College of Technology (ANG.U.TECH) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  ANG.U.TECH also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "ANG.U.TECH", "founded": " ", "motto": "\n\n ", "colors": "", "address": "3 Oak Street; PO Box LG 448 Teshie   Greater Accra Ghana", "tel": " +233 (302) 712 122", "fax": " +233 (302) 712 122"}, {"name": "Ashesi University", "ranking": "5", "website": "https://www.ashesi.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/1845.png", "description": "Founded in 2002,  Ashesi University is a non-profit private higher-education institution located in the rural setting of the small town of Berekuso (population range of under 2,500 inhabitants), Eastern Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Ashesi University (AU) is a very small (uniRank enrollment range: 500-999 students) coeducational Ghanaian higher education institution. Ashesi University (AU) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 20 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades.  The admission rate range is 10-20% making this Ghanaian higher education organization a most selective institution. International students are welcome to apply for enrollment.  AU also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  as well as administrative services.", "acronym": "AU", "founded": "2002 ", "motto": "Scholarship, Leadership, Citizenship ", "colors": "Black, white and terracota", "address": "1 University Avenue, PMB CT3 Cantonments Berekuso   Eastern Region Ghana", "tel": " +233 (302) 610 330", "fax": " +233 (302) 610 340"}, {"name": "BlueCrest College", "ranking": "38", "website": "https://bluecrest.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/15588.png", "description": "Established in 2000,  BlueCrest College is a for-profit private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), BlueCrest College (BCC) is a very small (uniRank enrollment range: 500-999 students) coeducational Ghanaian higher education institution. BlueCrest College (BCC) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees, master degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 22 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  The admission rate range is 60-70% making this Ghanaian higher education organization a somewhat selective institution. International applicants are eligible to apply for enrollment.  BCC also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "BCC", "founded": "2000 ", "motto": "Education For Life ", "colors": "Blue and white", "address": "Cola Street, Near ATTC, Adjacent Societe Generale Head Office, Kokomlemle, PO Box AN18392 Accra   Greater Accra Ghana", "tel": " +233 (302) 250 649", "fax": " +233 "}, {"name": "Bolgatanga Technical University", "ranking": "61", "website": "https://www.bolgatu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/10306.png", "description": "Established in 2003,  Bolgatanga Technical University is a non-profit public higher-education institution located in the large town of Bolgatanga (population range of 10,000-49,999 inhabitants), Upper East Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Bolgatanga Technical University (BTU) is a coeducational Ghanaian higher education institution. Bolgatanga Technical University (BTU) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  BTU also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "BTU", "founded": "2003 ", "motto": "\n\n ", "colors": "", "address": "PO Box 767 Bolgatanga   Upper East Region Ghana", "tel": " +233 (72) 24279", "fax": " +233 (72) 23103"}, {"name": "C.K. Tedam University of Technology and Applied Sciences", "ranking": "45", "website": "https://cktutas.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/18924.png", "description": "Established in 2020,  C.K. Tedam University of Technology and Applied Sciences is a non-profit public higher-education institution located in the large town of Navrongo (population range of 10,000-49,999 inhabitants), Upper East Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), C.K. Tedam University of Technology and Applied Sciences (CKTUTAS) is a very small (uniRank enrollment range: 1,000-1,999 students) coeducational Ghanaian higher education institution. C.K. Tedam University of Technology and Applied Sciences (CKTUTAS) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  CKTUTAS also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "CKTUTAS", "founded": "2020 ", "motto": "\n\n ", "colors": "", "address": "Box 24 Navrongo   Upper East Region Ghana", "tel": " +233 38 209 7373", "fax": " +233 "}, {"name": "Cape Coast Technical University", "ranking": "43", "website": "https://cctu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/10307.png", "description": "Founded in 1986,  Cape Coast Technical University is a non-profit public higher-education institution located in the small city of Cape Coast (population range of 50,000-249,999 inhabitants), Central Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Cape Coast Technical University (CCTU) is a coeducational Ghanaian higher education institution. Cape Coast Technical University (CCTU) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  CCTU also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "CCTU", "founded": "1986 ", "motto": "\n\n ", "colors": "", "address": "PO Box AD 50 Cape Coast   Central Region Ghana", "tel": " +233 (42) 33090", "fax": " +233 (42) 37428"}, {"name": "Catholic Institute of Business and Technology", "ranking": "68", "website": "https://cibt.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/14962.png", "description": " Catholic Institute of Business and Technology is a  private higher-education institution located in the metropolis of Accra North (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Catholic Institute of Business and Technology (CIBT) is a coeducational Ghanaian higher education institution formally affiliated with the Christian-Catholic religion. Catholic Institute of Business and Technology (CIBT) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  CIBT also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "CIBT", "founded": " ", "motto": "\n\n ", "colors": "", "address": "PO Box AN 5248 Accra North   Greater Accra Ghana", "tel": " +233 (307) 033 547", "fax": " +233 (302) 400 700"}, {"name": "Catholic University College of Ghana", "ranking": "29", "website": "https://www.cug.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11126.png", "description": "Established in 2003,  Catholic University College of Ghana is a  private higher-education institution located in the small city of Sunyani (population range of 50,000-249,999 inhabitants), Brong-Ahafo.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Catholic University College of Ghana (CUCG) is a coeducational Ghanaian higher education institution formally affiliated with the Christian-Catholic religion. Catholic University College of Ghana (CUCG) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  CUCG also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "CUCG", "founded": "2003 ", "motto": "Scientiae Ac Sapientiae Lumen Splendeat May the Light of Knowledge and Wisdom Shine Forth", "colors": "\n\n ", "address": "PO Box 363 Sunyani   Brong-Ahafo Ghana", "tel": " +233 (61) 24805", "fax": " +233 "}, {"name": "Central University", "ranking": "11", "website": "https://www.central.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/1846.png", "description": "Established in 1997,  Central University is a non-profit private higher-education institution located in the suburban setting of the small city of Tema (population range of 50,000-249,999 inhabitants), Greater Accra.  This institution also has branch campuses in the following locations: Prampram, Mataheko. Officially recognized by the Ministry of Education of Ghana, Central University (CUC) is a medium-sized (uniRank enrollment range: 8,000-8,999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Evangelical religion. Central University (CUC) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees, master degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 25 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades.  The admission rate range is 80-90% making this Ghanaian higher education organization a least selective institution. International applicants are eligible to apply for enrollment.  CUC also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "CUC", "founded": "1997 Origins date back to 1988", "motto": "Faith, Integrity and Excellence ", "colors": "Green, red and gold", "address": "PO Box 2305 Tema   Greater Accra Ghana", "tel": " +233 (28) 9546164/5", "fax": " +233 "}, {"name": "Christ Apostolic University College", "ranking": "53", "website": "https://cauc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13984.png", "description": "Established in 2010,  Christ Apostolic University College is a  private higher-education institution located in the metropolis of Kumasi (population range of 1,000,000-5,000,000 inhabitants), Ashanti.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Christ Apostolic University College (CAUC) is a coeducational Ghanaian higher education institution formally affiliated with the Christian-Pentecostal religion. Christ Apostolic University College (CAUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  CAUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "CAUC", "founded": "2010 ", "motto": "\n\n ", "colors": "", "address": "PO Box 15113 Kumasi   Ashanti Ghana", "tel": " +233 (3220) 99484", "fax": " +233 "}, {"name": "Christian Service University College", "ranking": "32", "website": "https://www.csuc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/14959.png", "description": "Founded in 1974,  Christian Service University College is a non-profit private higher-education institution located in the urban setting of the small town of Santasi-Kumasi (population range of under 2,500 inhabitants), Ashanti.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Christian Service University College (CSUC) is a very small (uniRank enrollment range: 1,000-1,999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Evangelical religion. Christian Service University College (CSUC) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 47 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  CSUC also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  study abroad and exchange programs,  as well as administrative services.", "acronym": "CSUC", "founded": "1974 ", "motto": "To Know God Better And To Make Him Better Known ", "colors": "Blue and white", "address": "Odeneho Kwadaso Street Santasi-Kumasi   Ashanti Ghana", "tel": " +233 (302) 25195", "fax": " +233 (302) 25195"}, {"name": "Data Link Institute", "ranking": "55", "website": "https://datalink.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/14963.png", "description": "Founded in 1993,  Data Link Institute is a non-profit private higher-education institution located in the suburban setting of the large city of Tema (population range of 500,000-1,000,000 inhabitants), Greater Accra.  This institution also has branch campuses in the following locations: Takoradi, Ho, Kpando. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Data Link Institute (DLI) is a small (uniRank enrollment range: 2,000-2,999 students) coeducational Ghanaian higher education institution. Data Link Institute (DLI) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees, master degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 29 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  The admission rate range is 90-100% making this Ghanaian higher education organization a least selective institution. International students are welcome to apply for enrollment.  DLI also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "DLI", "founded": "1993 ", "motto": "Ploughing minds for service ", "colors": "Ox red and blue", "address": "PO Box 2481, Tema Community 10 New Road Tema   Greater Accra Ghana", "tel": " +233 (303) 307 080", "fax": " +233 "}, {"name": "Dominion University College", "ranking": "44", "website": "https://duc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13980.png", "description": "Established in 2009,  Dominion University College is a  private higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Dominion University College (DUC) is a coeducational Ghanaian higher education institution formally affiliated with the Christian-Presbyterian religion. Dominion University College (DUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  DUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "DUC", "founded": "2009 ", "motto": "\n\n ", "colors": "", "address": "Off Tetteh Quashie Interchange, Spintex Road Accra   Greater Accra Ghana", "tel": " +233 (30) 296 7755 - 9", "fax": " +233 "}, {"name": "Dr. Hilla Limann Technical University", "ranking": "58", "website": "https://dhltu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/10314.png", "description": "Established in 1999,  Dr. Hilla Limann Technical University is a non-profit public higher-education institution located in the small city of Wa (population range of 50,000-249,999 inhabitants), Upper West Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Dr. Hilla Limann Technical University  is a coeducational Ghanaian higher education institution. Dr. Hilla Limann Technical University offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  Dr. Hilla Limann Technical University also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "", "founded": "1999 ", "motto": "Knowledge, Application and Service ", "colors": "\n\n ", "address": "PO Box 553 Wa   Upper West Region Ghana", "tel": " +233 0241450710", "fax": " +233 "}, {"name": "Evangelical Presbyterian University College", "ranking": "52", "website": "http://www.epuc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13989.png", "description": "Founded in 2008,  Evangelical Presbyterian University College is a  private higher-education institution located in the small city of Ho (population range of 50,000-249,999 inhabitants), Volta.  This institution also has a branch campus in Peki. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Evangelical Presbyterian University College (EPUC) is a coeducational Ghanaian higher education institution formally affiliated with the Christian-Presbyterian religion. Evangelical Presbyterian University College (EPUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  EPUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "EPUC", "founded": "2008 ", "motto": "\n\n ", "colors": "", "address": "PO Box HP 678 Ho   Volta Ghana", "tel": " +233 (91) 26724", "fax": " +233 "}, {"name": "Garden City University College", "ranking": "23", "website": "https://www.gcuc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11136.png", "description": "Established in 2001,  Garden City University College is a for-profit private higher-education institution located in the urban setting of the metropolis of Kumasi (population range of 1,000,000-5,000,000 inhabitants), Ashanti.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Garden City University College (GCUC) is a very small (uniRank enrollment range: 1,000-1,999 students) coeducational Ghanaian higher education institution. Garden City University College (GCUC) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 21 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades. International applicants are eligible to apply for enrollment.  GCUC also provides several academic and non-academic facilities and services to students including a library,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  as well as administrative services.", "acronym": "GCUC", "founded": "2001 ", "motto": "Creatio Innovatorum Developing the next generation of Innovators", "colors": "Green and yellow", "address": "PO Box 12755 Kumasi   Ashanti Ghana", "tel": " +233 (51) 73927", "fax": " +233 "}, {"name": "Ghana Baptist University College", "ranking": "47", "website": "https://gbuc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11132.png", "description": "Established in 2006,  Ghana Baptist University College is a  private higher-education institution located in the urban setting of the large town of Abuakwa-Kumasi (population range of 10,000-49,999 inhabitants), Ashanti.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Ghana Baptist University College (GBUC) is a very small (uniRank enrollment range: 1,000-1,999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Baptist religion. Ghana Baptist University College (GBUC) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  GBUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "GBUC", "founded": "2006 ", "motto": "Excellence in Leadership and Stewardship ", "colors": "\n\n ", "address": "PO Box 1 Abuakwa-Kumasi   Ashanti Ghana", "tel": " +233 (51) 50030", "fax": " +233 "}, {"name": "Ghana Christian University College", "ranking": "62", "website": "https://ghanacu.com", "logo": "https://www.4icu.org/i/logos-seals/11133.png", "description": "Founded in 1966,  Ghana Christian University College is a  private higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Ghana Christian University College (GhanaCU) is a very small (uniRank enrollment range: 500-999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Evangelical religion. Ghana Christian University College (GhanaCU) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  GhanaCU also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "GhanaCU", "founded": "1966 ", "motto": "\n\n ", "colors": "", "address": "PO Box DD 48, Dodowa Accra   Greater Accra Ghana", "tel": " +233 (22) 252 042", "fax": " +233 (22) 252 180"}, {"name": "Ghana Institute of Journalism", "ranking": "24", "website": "https://gij.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/15584.png", "description": "Established in 1959,  Ghana Institute of Journalism is a non-profit public higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the Ministry of Education of Ghana, Ghana Institute of Journalism (GIJ) is a coeducational Ghanaian higher education institution. Ghana Institute of Journalism (GIJ) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  GIJ also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "GIJ", "founded": "1959 ", "motto": "\n\n ", "colors": "", "address": "32nd Gamel Abdul Nasser Road Osu; PO Box GP 667 Accra   Greater Accra Ghana", "tel": " +233 302 228336", "fax": " +233 302 221750"}, {"name": "Ghana Institute of Languages", "ranking": "59", "website": "http://www.gil.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/15585.png", "description": "Founded in 1961,  Ghana Institute of Languages is a non-profit public higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.  This institution also has branch campuses in the following locations: East Legon, Kumasi, Tamale. Officially recognized by the Ministry of Education of Ghana, Ghana Institute of Languages (GIL) is a very small (uniRank enrollment range: 1,000-1,999 students) coeducational Ghanaian higher education institution. Ghana Institute of Languages (GIL) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 61 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades. International students are welcome to apply for enrollment.  GIL also provides several academic and non-academic facilities and services to students including a library,  sports facilities,  study abroad and exchange programs,  as well as administrative services.", "acronym": "GIL", "founded": "1961 ", "motto": "Breaking barriers through languages ", "colors": "\n\n ", "address": "GIL City Campus, Off Barnes Road, Adabraka PO Box M67 Accra   Greater Accra Ghana", "tel": " +233 (577) 734 441", "fax": " +233 (577) 734 444"}, {"name": "Ghana Institute of Management and Public Administration", "ranking": "6", "website": "https://www.gimpa.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/7238.png", "description": "Established in 1961,  Ghana Institute of Management and Public Administration is a non-profit public higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Ghana Institute of Management and Public Administration (GIMPA) is a coeducational Ghanaian higher education institution. Ghana Institute of Management and Public Administration (GIMPA) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  GIMPA also provides several academic and non-academic facilities and services to students including a library,  sports facilities,  study abroad and exchange programs,  as well as administrative services.", "acronym": "GIMPA", "founded": "1961 ", "motto": "Excellence Leadership, Management and Administration ", "colors": "\n\n ", "address": "PO Box AH 50 Achimota Accra   Greater Accra Ghana", "tel": " +233 (21) 401 681", "fax": " +233 (21) 405 805"}, {"name": "Ghana Technology University College", "ranking": "17", "website": "https://gtuc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11125.png", "description": "Founded in 2006,  Ghana Technology University College is a  private higher-education institution located in the urban setting of the metropolis of Accra North (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.  This institution also has branch campuses in the following locations: Kumasi, Takoradi, Koforidua, Ho. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Ghana Technology University College (GTUC) is a medium-sized (uniRank enrollment range: 8,000-8,999 students) coeducational Ghanaian higher education institution. Ghana Technology University College (GTUC) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees, master degrees, doctorate degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 16 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades.  The admission rate range is 80-90% making this Ghanaian higher education organization a least selective institution. International students are welcome to apply for enrollment.  GTUC also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  as well as administrative services.", "acronym": "GTUC", "founded": "2006 ", "motto": "Knowledge comes from learning ", "colors": "\n\n ", "address": "Private Mailbox 100 Accra North   Greater Accra Ghana", "tel": " +233 (21) 221 412", "fax": " +233 (21) 223 531"}, {"name": "Ho Technical University", "ranking": "27", "website": "https://www.htu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/10308.png", "description": "Established in 1968,  Ho Technical University is a non-profit public higher-education institution located in the urban setting of the small city of Ho (population range of 50,000-249,999 inhabitants), Volta.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Ho Technical University (HTU) is a coeducational Ghanaian higher education institution. Ho Technical University (HTU) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 54 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades. International applicants are eligible to apply for enrollment.  HTU also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "HTU", "founded": "1968 ", "motto": "Adanu Nazu kekeli ", "colors": "Blue and white", "address": "PO Box 217 Ho   Volta Ghana", "tel": " +233 (3620) 26621", "fax": " +233 (3620) 28398"}, {"name": "Islamic University College, Ghana", "ranking": "33", "website": "https://iug.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11127.png", "description": "Founded in 1988,  Islamic University College, Ghana is a non-profit private higher-education institution located in the suburban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Islamic University College, Ghana (IUG) is a very small (uniRank enrollment range: 500-999 students) coeducational Ghanaian higher education institution formally affiliated with the Islamic religion. Islamic University College, Ghana (IUG) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees, master degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 34 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades. International students are welcome to apply for enrollment.  IUG also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "IUG", "founded": "1988 ", "motto": "Knowledge, Faith and Service ", "colors": "\n\n ", "address": "Adjiringanor, East Legon - Transacco Estate Road Accra   Greater Accra Ghana", "tel": " +233 (30) 282 4069", "fax": " +233 (30) 282 4075"}, {"name": "Jayee University College", "ranking": "60", "website": "https://juc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13995.png", "description": "Founded in 1988,  Jayee University College is a  private higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Jayee University College (JUC) is a coeducational Ghanaian higher education institution. Jayee University College (JUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  JUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "JUC", "founded": "1988 ", "motto": "\n\n ", "colors": "", "address": "Royal Palm Avenue, McCarthy Hill, Mango Lane Accra   Greater Accra Ghana", "tel": " +233 (302) 335 055", "fax": " +233 "}, {"name": "KAAF University College", "ranking": "48", "website": "https://www.kaafuni.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13987.png", "description": "Founded in 2007,  KAAF University College is a for-profit private higher-education institution located in the urban setting of the small city of Kasoa (population range of 50,000-249,999 inhabitants), Central Region.  This institution also has a branch campus in Accra. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), KAAF University College (KAAF) is a very small (uniRank enrollment range: 1,000-1,999 students) coeducational Ghanaian higher education institution. KAAF University College (KAAF) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 15 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  The admission rate range is 10-20% making this Ghanaian higher education organization a most selective institution. International students are welcome to apply for enrollment.  KAAF also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  as well as administrative services.", "acronym": "KAAF", "founded": "2007 ", "motto": "Knowledge and Excellence ", "colors": "Black and gold", "address": "KAAF Avenue Street, Gomoa Fetteh Kakraba Kasoa   Central Region Ghana", "tel": " +233 (20) 112 1353", "fax": " +233 (21) 220 598"}, {"name": "Kessben College", "ranking": "65", "website": "https://kc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/17629.png", "description": " Kessben College is a  private higher-education institution located in the small city of Kuntenase (population range of 50,000-249,999 inhabitants), Ashanti.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Kessben College (KC) is a coeducational Ghanaian higher education institution. Kessben College (KC) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  KC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "KC", "founded": " ", "motto": "Education for Development ", "colors": "\n\n ", "address": "Lake Bosomtwi Road Kuntenase   Ashanti Ghana", "tel": " +233 (322) 397 850/2", "fax": " +233 (322) 03 7420"}, {"name": "Kings University College", "ranking": "50", "website": "https://www.kuc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13986.png", "description": "Established in 2009,  Kings University College is a  private higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Kings University College (KUC) is a coeducational Ghanaian higher education institution. Kings University College (KUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  KUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "KUC", "founded": "2009 ", "motto": "\n\n ", "colors": "", "address": "Aplaku Hills, Off Old Weija Barrier Bojo Beach Road; PO Box GP 18835 Accra   Greater Accra Ghana", "tel": " +233 (302) 917 673", "fax": " +233 "}, {"name": "Knutsford University College", "ranking": "49", "website": "https://knutsford.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11137.png", "description": "Founded in 2005,  Knutsford University College is a for-profit private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.  This institution also has a branch campus in East Legon. Officially recognized by the Ministry of Education of Ghana, Knutsford University College (KUC) is a small (uniRank enrollment range: 2,000-2,999 students) coeducational Ghanaian higher education institution. Knutsford University College (KUC) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation) in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 17 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  The admission rate range is 50-60% making this Ghanaian higher education organization a averagely selective institution. International students are welcome to apply for enrollment.  KUC also provides several academic and non-academic facilities and services to students including a library,  sports facilities,  study abroad and exchange programs,  as well as administrative services.", "acronym": "KUC", "founded": "2005 ", "motto": "\n\n ", "colors": "", "address": "PO Box 150 Accra   Greater Accra Ghana", "tel": " +233 (302) 521 611", "fax": " +233 (302) 544 022"}, {"name": "Koforidua Technical University", "ranking": "26", "website": "https://www.ktu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/10309.png", "description": "Founded in 1997,  Koforidua Technical University is a non-profit public higher-education institution located in the small city of Koforidua (population range of 50,000-249,999 inhabitants), Eastern Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Koforidua Technical University (KTU) is a small (uniRank enrollment range: 5,000-5,999 students) coeducational Ghanaian higher education institution. Koforidua Technical University (KTU) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  KTU also provides several academic and non-academic facilities and services to students including a library,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "KTU", "founded": "1997 ", "motto": "Innovating for Development ", "colors": "\n\n ", "address": "PO Box 981 Koforidua   Eastern Region Ghana", "tel": " +233 (3420) 24466", "fax": " +233 "}, {"name": "Kumasi Technical University", "ranking": "15", "website": "https://www.kstu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/10310.png", "description": "Established in 1954,  Kumasi Technical University is a non-profit public higher-education institution located in the metropolis of Kumasi (population range of 1,000,000-5,000,000 inhabitants), Ashanti.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Kumasi Technical University (KTU) is a coeducational Ghanaian higher education institution. Kumasi Technical University (KTU) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  KTU also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "KTU", "founded": "1954 ", "motto": "\n\n ", "colors": "", "address": "PO Box 854 Kumasi   Ashanti Ghana", "tel": " +233 (3220) 23387", "fax": " +233 (3220) 23387"}, {"name": "Kwame Nkrumah University of Science and Technology", "ranking": "2", "website": "https://www.knust.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/1847.png", "description": "Founded in 1951,  Kwame Nkrumah University of Science and Technology is a non-profit public higher-education institution located in the urban setting of the metropolis of Kumasi (population range of 1,000,000-5,000,000 inhabitants), Ashanti.  This institution also has branch campuses in the following locations: Sunyani, Accra. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Kwame Nkrumah University of Science and Technology (KNUST) is a large (uniRank enrollment range: 25,000-29,999 students) coeducational Ghanaian higher education institution. Kwame Nkrumah University of Science and Technology (KNUST) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees, master degrees, doctorate degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 71 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  The admission rate range is 30-40% making this Ghanaian higher education organization a very selective institution. International students are welcome to apply for enrollment.  KNUST also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "KNUST", "founded": "1951 ", "motto": "Nyansap? w?sane no badwenma A wise knot is untied by a wise child", "colors": "Red, yellow, green, black and white", "address": "Private Mail Bag University Post Office Kumasi   Ashanti Ghana", "tel": " +233 (3220) 60021", "fax": " +233 (51) 60137"}, {"name": "Lancaster University, Ghana", "ranking": "12", "website": "https://lancaster.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/15586.png", "description": "Established in 2013,  Lancaster University, Ghana is a non-profit private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Lancaster University, Ghana (LUG) is a very small (uniRank enrollment range: 500-999 students) coeducational Ghanaian higher education institution. Lancaster University, Ghana (LUG) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. International applicants are eligible to apply for enrollment.  LUG also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  as well as administrative services.", "acronym": "LUG", "founded": "2013 ", "motto": "Patet omnibus veritas Truth lies open to all", "colors": "\n\n ", "address": "A&C Square, East Legon Accra   Greater Accra Ghana", "tel": " +233 (302) 747 700", "fax": " +233 "}, {"name": "Maranatha University College", "ranking": "Un", "website": "http://muc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11134.png", "description": "Established in 1972,  Maranatha University College is a  private higher-education institution located in the metropolis of Accra North (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Maranatha University College (MUC) is a coeducational Ghanaian higher education institution formally affiliated with the Christian-Evangelical religion. Maranatha University College (MUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  MUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "MUC", "founded": "1972 ", "motto": "", "colors": "", "address": "PO Box AN 10320 Accra North   Greater Accra Ghana", "tel": " +233 (21) 417581", "fax": " +233 (21) 417604"}, {"name": "Marshalls University College", "ranking": "57", "website": "http://www.marshalls.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/14844.png", "description": "Established in 2012,  Marshalls University College is a for-profit private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.  This institution also has a branch campus in Akosombo. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Marshalls University College (MARSHALLS) is a very small (uniRank enrollment range: 1,000-1,999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Catholic religion. Marshalls University College (MARSHALLS) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 10 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades.  The admission rate range is 80-90% making this Ghanaian higher education organization a least selective institution. International applicants are eligible to apply for enrollment.  MARSHALLS also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  as well as administrative services.", "acronym": "MARSHALLS", "founded": "2012 ", "motto": "Think Innovation, Think Possiblities ", "colors": "Green, blue, red, black, white and gold", "address": "PO BOX KB 781 Korle-Bu Accra   Greater Accra Ghana", "tel": " +233 (242) 561 005", "fax": " +233 "}, {"name": "Methodist University College", "ranking": "28", "website": "https://mucg.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11129.png", "description": "Founded in 2000,  Methodist University College is a  private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Methodist University College (MUCG) is a very small (uniRank enrollment range: 1,000-1,999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Methodist religion. Methodist University College (MUCG) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees, master degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  MUCG also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "MUCG", "founded": "2000 ", "motto": "Excellence Morality Service ", "colors": "\n\n ", "address": "PO Box DS 940, Dansoman Accra   Greater Accra Ghana", "tel": " +233 (21) 312 98", "fax": " +233 "}, {"name": "Mountcrest University College", "ranking": "56", "website": "https://mountcrestuniversity.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13979.png", "description": "Founded in 2008,  Mountcrest University College is a  private higher-education institution located in the suburban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.  This institution also has a branch campus in Larteh. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Mountcrest University College (MCUC) is a coeducational Ghanaian higher education institution. Mountcrest University College (MCUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  MCUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "MCUC", "founded": "2008 ", "motto": "\n\n ", "colors": "", "address": "12 Ablade Road, Kanda Estates Accra   Greater Accra Ghana", "tel": " +233 (302) 937 219", "fax": " +233 "}, {"name": "Pentecost University", "ranking": "18", "website": "https://pentvars.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13091.png", "description": "Founded in 2003,  Pentecost University is a non-profit private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Pentecost University (PUC) is a small (uniRank enrollment range: 2,000-2,999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Pentecostal religion. Pentecost University (PUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 19 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades. International students are welcome to apply for enrollment.  PUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "PUC", "founded": "2003 ", "motto": "Empowered to Serve ", "colors": "Blue, red and gold", "address": "PO Box KN 1739, Kaneshie Accra   Greater Accra Ghana", "tel": " +233 (302) 417057-8", "fax": " +233 (302) 417064"}, {"name": "Perez University College", "ranking": "67", "website": "https://www.perez.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/15587.png", "description": "Founded in 2001,  Perez University College is a  private higher-education institution located in the large town of Winneba (population range of 10,000-49,999 inhabitants), Central Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Perez University College (PERUC) is a coeducational Ghanaian higher education institution. Perez University College (PERUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  PERUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "PERUC", "founded": "2001 ", "motto": "\n\n ", "colors": "", "address": " Winneba   Central Region Ghana", "tel": " +233 ", "fax": " +233 "}, {"name": "Presbyterian University College", "ranking": "19", "website": "https://www.presbyuniversity.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11130.png", "description": "Established in 2003,  Presbyterian University College is a non-profit private higher-education institution located in the suburban setting of the medium town of Abetifi (population range of 2,500-9,999 inhabitants), Eastern Region.  This institution also has branch campuses in the following locations: Asante Akyem, Akuapem and Tema. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Presbyterian University College (PUCG) is a very small (uniRank enrollment range: 1,000-1,999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Presbyterian religion. Presbyterian University College (PUCG) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 18 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades. International applicants are eligible to apply for enrollment.  PUCG also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "PUCG", "founded": "2003 ", "motto": "Discipline in Leadership ", "colors": "Blue, red, white and green", "address": "PO Box 59 Abetifi  233 Eastern Region Ghana", "tel": " +233 (34) 203 0037", "fax": " +233 (34) 203 0038"}, {"name": "Radford University College", "ranking": "42", "website": "https://www.ruc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13985.png", "description": " Radford University College is a  private higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Radford University College (RUC) is a coeducational Ghanaian higher education institution. Radford University College (RUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  RUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "RUC", "founded": " ", "motto": "\n\n ", "colors": "", "address": "PO Box CT 2837, Cantoment Accra   Greater Accra Ghana", "tel": " +233 (302) 522 267", "fax": " +233 "}, {"name": "Regent University College of Science and Technology", "ranking": "22", "website": "http://regent.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/11131.png", "description": "Founded in 2003,  Regent University College of Science and Technology is a  private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Regent University College of Science and Technology (RUCST) is a small (uniRank enrollment range: 2,000-2,999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Evangelical religion. Regent University College of Science and Technology (RUCST) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees, doctorate degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 19 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades. International students are welcome to apply for enrollment.  RUCST also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "RUCST", "founded": "2003 ", "motto": "Peace, Justice and Industry ", "colors": "\n\n ", "address": "PO Box DS 1636, Dansoman Accra   Greater Accra Ghana", "tel": " +233 (503) 030 999", "fax": " +233 (302) 325 064"}, {"name": "Regional Maritime University", "ranking": "31", "website": "https://rmu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/14845.png", "description": "Founded in 1983,  Regional Maritime University is a non-profit private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Regional Maritime University (RMU) is a coeducational Ghanaian higher education institution. Regional Maritime University (RMU) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  RMU also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "RMU", "founded": "1983 ", "motto": "Centre of Excellence ", "colors": "\n\n ", "address": "PO Box 1115 Accra   Greater Accra Ghana", "tel": " +233 (302) 712 343", "fax": " +233 "}, {"name": "Simon Diedong Dombo University of Business and Integrated Development Studies", "ranking": "37", "website": "https://ubids.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/18923.png", "description": "Founded in 2020,  Simon Diedong Dombo University of Business and Integrated Development Studies is a non-profit public higher-education institution located in the small city of Wa (population range of 50,000-249,999 inhabitants), Upper West Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Simon Diedong Dombo University of Business and Integrated Development Studies (SDD-UBIDS) is a coeducational Ghanaian higher education institution. Simon Diedong Dombo University of Business and Integrated Development Studies (SDD-UBIDS) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  SDD-UBIDS also provides several academic and non-academic facilities and services to students including  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "SDD-UBIDS", "founded": "2020 ", "motto": "\n\n ", "colors": "", "address": "XW-1147-8901, Bamahu Wa   Upper West Region Ghana", "tel": " +233 39 209 7256", "fax": " +233 "}, {"name": "Spiritan University College", "ranking": "63", "website": "https://suc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13994.png", "description": "Established in 1990,  Spiritan University College is a  private higher-education institution located in the small city of Ejisu (population range of 50,000-249,999 inhabitants), Ashanti.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Spiritan University College (SUC) is a coeducational Ghanaian higher education institution formally affiliated with the Christian-Catholic religion. Spiritan University College (SUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  SUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "SUC", "founded": "1990 ", "motto": "\n\n ", "colors": "", "address": "PO Box Box 111 Ejisu   Ashanti Ghana", "tel": " +233 (3220) 94456-60", "fax": " +233 (3220) 20184"}, {"name": "Sunyani Technical University", "ranking": "40", "website": "https://stu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/10311.png", "description": "Founded in 1983,  Sunyani Technical University is a non-profit public higher-education institution located in the small city of Sunyani (population range of 50,000-249,999 inhabitants), Brong-Ahafo.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Sunyani Technical University (STU) is a coeducational Ghanaian higher education institution. Sunyani Technical University (STU) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation) in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  STU also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "STU", "founded": "1983 ", "motto": "Education for progress ", "colors": "Green and white", "address": "PO Box 206 Sunyani   Brong-Ahafo Ghana", "tel": " +233 (61) 27050", "fax": " +233 (61) 24921"}, {"name": "Takoradi Technical University", "ranking": "36", "website": "https://ttu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/12298.png", "description": "Established in 1954,  Takoradi Technical University is a non-profit public higher-education institution located in the urban setting of the medium town of Takoradi (population range of 2,500-9,999 inhabitants), Western Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Takoradi Technical University (TTU) is a medium-sized (uniRank enrollment range: 9,000-9,999 students) coeducational Ghanaian higher education institution. Takoradi Technical University (TTU) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation) in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 68 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades.  The admission rate range is 90-100% making this Ghanaian higher education organization a least selective institution. International applicants are eligible to apply for enrollment.  TTU also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  as well as administrative services.", "acronym": "TTU", "founded": "1954 ", "motto": "Nsa na adwen ma mpuntu Skills combined with wisdom accelerates development", "colors": "Blue and yellow", "address": "PO Box 256 Takoradi   Western Region Ghana", "tel": " +233 3122917", "fax": " +233 27312526"}, {"name": "Tamale Technical University", "ranking": "39", "website": "https://tatu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/10313.png", "description": "Founded in 1950,  Tamale Technical University is a non-profit public higher-education institution located in the small city of Tamale (population range of 50,000-249,999 inhabitants), Northern Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Tamale Technical University (TTU) is a coeducational Ghanaian higher education institution. Tamale Technical University (TTU) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  TTU also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "TTU", "founded": "1950 ", "motto": "\n\n ", "colors": "", "address": "PO Box 3 E/R Tamale   Northern Region Ghana", "tel": " +233 (37020) 22771", "fax": " +233 (71) 23849"}, {"name": "University College of Agriculture and Environmental Studies", "ranking": "66", "website": "https://ucaes.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13983.png", "description": "Founded in 2006,  University College of Agriculture and Environmental Studies is a  private higher-education institution located in the suburban setting of the large town of Bunso (population range of 10,000-49,999 inhabitants), Eastern Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), University College of Agriculture and Environmental Studies (UCAES) is a coeducational Ghanaian higher education institution. University College of Agriculture and Environmental Studies (UCAES) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  UCAES also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "UCAES", "founded": "2006 ", "motto": "\n\n ", "colors": "", "address": "PO Box 25 Bunso   Eastern Region Ghana", "tel": " +233 (54) 237 7435", "fax": " +233 (54) 399 0554"}, {"name": "University College of Management Studies", "ranking": "51", "website": "https://ucoms.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13092.png", "description": "Established in 1974,  University College of Management Studies is a for-profit private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.  This institution also has a branch campus in Kumasi. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), University College of Management Studies (UCOMS) is a small (uniRank enrollment range: 4,000-4,999 students) coeducational Ghanaian higher education institution. University College of Management Studies (UCOMS) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 48 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  The admission rate range is 80-90% making this Ghanaian higher education organization a least selective institution. International applicants are eligible to apply for enrollment.  UCOMS also provides several academic and non-academic facilities and services to students including a library,  sports facilities,  financial aids and/or scholarships,  as well as administrative services.", "acronym": "UCOMS", "founded": "1974 ", "motto": "Search for Wisdom ", "colors": "\n\n ", "address": "PO Box GP 482 Accra   Greater Accra Ghana", "tel": " +233 (302) 853 304", "fax": " +233 (302) 853 304"}, {"name": "University for Development Studies", "ranking": "7", "website": "https://uds.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/10304.png", "description": "Established in 1992,  University for Development Studies is a non-profit public higher-education institution located in the suburban setting of the small city of Tamale (population range of 50,000-249,999 inhabitants), Northern Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), University for Development Studies (UDS) is a coeducational Ghanaian higher education institution. University for Development Studies (UDS) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  UDS also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "UDS", "founded": "1992 ", "motto": "Knowledge for Service ", "colors": "\n\n ", "address": "PO Box TL 1350 Tamale   Northern Region Ghana", "tel": " +233 (71) 22422", "fax": " +233 (71) 23957"}, {"name": "University of Cape Coast", "ranking": "3", "website": "https://ucc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/1848.png", "description": "Established in 1962,  University of Cape Coast is a non-profit public higher-education institution located in the suburban setting of the small city of Cape Coast (population range of 50,000-249,999 inhabitants), Central Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), University of Cape Coast (UCC) is a very large (uniRank enrollment range: 30,000-34,999 students) coeducational Ghanaian higher education institution. University of Cape Coast (UCC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 59 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades. International applicants are eligible to apply for enrollment.  UCC also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "UCC", "founded": "1962 ", "motto": "Veritas Nobis Lumen The Truth, Our Guide", "colors": "\n\n ", "address": "Sekondi Road Cape Coast   Central Region Ghana", "tel": " +233 (3321) 32440", "fax": " +233 (42) 32484"}, {"name": "University of Education, Winneba", "ranking": "4", "website": "https://www.uew.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/1849.png", "description": "Founded in 1992,  University of Education, Winneba is a non-profit public higher-education institution located in the suburban setting of the large town of Winneba (population range of 10,000-49,999 inhabitants), Central Region.  This institution also has branch campuses in the following locations: Kumasi, Ashanti Mampong, Ajumako. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), University of Education, Winneba (UEW) is a large (uniRank enrollment range: 10,000-14,999 students) coeducational Ghanaian higher education institution. University of Education, Winneba (UEW) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees, master degrees, doctorate degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 30 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  The admission rate range is 50-60% making this Ghanaian higher education organization a averagely selective institution. International students are welcome to apply for enrollment.  UEW also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "UEW", "founded": "1992 ", "motto": "Education for Service ", "colors": "Blue, red and white", "address": "PO Box 25 Winneba   Central Region Ghana", "tel": " +233 (3323) 22139", "fax": " +233 (3323) 22361"}, {"name": "University of Energy and Natural Resources", "ranking": "16", "website": "https://uenr.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/14841.png", "description": "Founded in 2011,  University of Energy and Natural Resources is a non-profit public higher-education institution located in the suburban setting of the small city of Sunyani (population range of 50,000-249,999 inhabitants), Brong-Ahafo.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), University of Energy and Natural Resources (UENR) is a coeducational Ghanaian higher education institution. University of Energy and Natural Resources (UENR) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees, master degrees, doctorate degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  UENR also provides several academic and non-academic facilities and services to students including a library,  housing,  as well as administrative services.", "acronym": "UENR", "founded": "2011 ", "motto": "Knowledge, Integrity, Impact ", "colors": "\n\n ", "address": "PO Box 214 Sunyani   Brong-Ahafo Ghana", "tel": " +233 (352) 23461", "fax": " +233 (277) 046 948"}, {"name": "University of Ghana", "ranking": "1", "website": "https://www.ug.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/1850.png", "description": "Established in 1948,  University of Ghana is a non-profit public higher-education institution located in the urban setting of the metropolis of Legon (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.  This institution also has branch campuses in the following locations: Korle-Bu, Accra City. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), University of Ghana (UG) is a very large (uniRank enrollment range: 30,000-34,999 students) coeducational Ghanaian higher education institution. University of Ghana (UG) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees, master degrees, doctorate degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 74 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  The admission rate range is 30-40% making this Ghanaian higher education organization a very selective institution. International applicants are eligible to apply for enrollment.  UG also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "UG", "founded": "1948 ", "motto": "Integri Procedamus Proceed with Integrity", "colors": "Blue and gold", "address": "PO Box LG25 Legon  00233 Greater Accra Ghana", "tel": " +233 (21) 500 381", "fax": " +233 (21) 500 263"}, {"name": "University of Health and Allied Sciences", "ranking": "14", "website": "https://www.uhas.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/14842.png", "description": "Established in 2011,  University of Health and Allied Sciences is a non-profit public higher-education institution located in the small city of Ho (population range of 50,000-249,999 inhabitants), Volta.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), University of Health and Allied Sciences (UHAS) is a coeducational Ghanaian higher education institution. University of Health and Allied Sciences (UHAS) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees, master degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  UHAS also provides several academic and non-academic facilities and services to students including a library,  housing,  as well as administrative services.", "acronym": "UHAS", "founded": "2011 ", "motto": "\n\n ", "colors": "", "address": "Private Mailbox 31 Ho   Volta Ghana", "tel": " +233 (362) 190 942", "fax": " +233 "}, {"name": "University of Mines and Technology", "ranking": "10", "website": "https://www.umat.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/7661.png", "description": "Founded in 2004,  University of Mines and Technology is a non-profit public higher-education institution located in the suburban setting of the large city of Tarkwa (population range of 500,000-1,000,000 inhabitants), Western Region.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), University of Mines and Technology (UMaT) is a very small (uniRank enrollment range: 1,000-1,999 students) coeducational Ghanaian higher education institution. University of Mines and Technology (UMaT) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees, master degrees, doctorate degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 17 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades.  The admission rate range is 20-30% making this Ghanaian higher education organization a very selective institution. International students are welcome to apply for enrollment.  UMaT also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  as well as administrative services.", "acronym": "UMaT", "founded": "2004 ", "motto": "Knowledge, Truth and Excellence ", "colors": "Yellow, green and red", "address": "PO Box 237 Tarkwa   Western Region Ghana", "tel": " +233 (3123) 20324", "fax": " +233 (3123) 20306"}, {"name": "University of Professional Studies, Accra", "ranking": "21", "website": "https://upsa.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/14843.png", "description": "Founded in 1965,  University of Professional Studies, Accra is a non-profit public higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), University of Professional Studies, Accra (UPSA) is a large (uniRank enrollment range: 10,000-14,999 students) coeducational Ghanaian higher education institution. University of Professional Studies, Accra (UPSA) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees, master degrees, doctorate degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 57 years old Ghanaian higher-education institution has a selective admission policy based on entrance examinations and students' past academic record and grades.  The admission rate range is 60-70% making this Ghanaian higher education organization a somewhat selective institution. International students are welcome to apply for enrollment.  UPSA also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "UPSA", "founded": "1965 ", "motto": "Scholarship with Professionalism ", "colors": "Blue and gold", "address": "East legon; PO Box LG 149 Accra   Greater Accra Ghana", "tel": " +233 (303) 500 171", "fax": " +233 (302) 501 174"}, {"name": "Valley View University", "ranking": "8", "website": "https://www.vvu.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/1851.png", "description": "Founded in 1979,  Valley View University is a  private higher-education institution located in the urban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.  This institution also has branch campuses in the following locations: Techiman, Accra, Kumasi, Tamale, Takoradi. Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Valley View University (VVU) is a large (uniRank enrollment range: 10,000-14,999 students) coeducational Ghanaian higher education institution formally affiliated with the Christian-Adventist religion. Valley View University (VVU) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details. This 43 years old Ghanaian higher-education institution has a selective admission policy based on students' past academic record and grades.  The admission rate range is 70-80% making this Ghanaian higher education organization a somewhat selective institution. International students are welcome to apply for enrollment.  VVU also provides several academic and non-academic facilities and services to students including a library,  housing,  sports facilities,  financial aids and/or scholarships,  study abroad and exchange programs,  online courses and distance learning opportunities,  as well as administrative services.", "acronym": "VVU", "founded": "1979 ", "motto": "Excellence, Integrity, Service ", "colors": "Blue, gold and white", "address": "PO Box DT 595 Adentan Accra   Greater Accra Ghana", "tel": " +233 (307) 011 832", "fax": " +233 (21) 508 998"}, {"name": "Webster University Ghana", "ranking": "20", "website": "https://webster.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/17601.png", "description": "Founded in 2013,  Webster University Ghana is a  private higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Webster University Ghana  is a coeducational Ghanaian higher education institution. Webster University Ghana offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees, master degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  Webster University Ghana also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "", "founded": "2013 ", "motto": "Navy, gold and white", "colors": "\n\n ", "address": "Plot 445B Luanda Close, Off Lagos Avenue, East Legon Accra   Greater Accra Ghana", "tel": " +233 (540) 120 849", "fax": " +233 (540) 120 869"}, {"name": "West End University College", "ranking": "54", "website": "https://weuc.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13982.png", "description": "Established in 2010,  West End University College is a  private higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the Ministry of Education of Ghana, West End University College (WEUC) is a coeducational Ghanaian higher education institution. West End University College (WEUC) offers courses and programs leading to officially recognized higher education degrees such as pre-bachelor degrees (i.e. certificates, diplomas, associate or foundation), bachelor degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  WEUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "WEUC", "founded": "2010 ", "motto": "Bridging Industry and Academia ", "colors": "Blue, white and black", "address": "PO Box AN 15042 Accra   Greater Accra Ghana", "tel": " +233 505 091 995", "fax": " +233 (302) 774 313"}, {"name": "Wisconsin International University College", "ranking": "25", "website": "https://wiuc-ghana.edu.gh", "logo": "https://www.4icu.org/i/logos-seals/13990.png", "description": "Established in 2000,  Wisconsin International University College is a  private higher-education institution located in the suburban setting of the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Wisconsin International University College (WIUC) is a coeducational Ghanaian higher education institution. Wisconsin International University College (WIUC) offers courses and programs leading to officially recognized higher education degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  WIUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "WIUC", "founded": "2000 ", "motto": "Peace, Harmony, Freedom, Truth, Knowledge ", "colors": "\n\n ", "address": "PO Box LG 751 Accra   Greater Accra Ghana", "tel": " +233 (302) 501449", "fax": " +233 "}, {"name": "Zenith University College", "ranking": "41", "website": "https://zucghana.org", "logo": "https://www.4icu.org/i/logos-seals/13993.png", "description": "Founded in 2001,  Zenith University College is a  private higher-education institution located in the metropolis of Accra (population range of 1,000,000-5,000,000 inhabitants), Greater Accra.   Officially recognized by the National Accreditation Board, Ghana (National Accreditation Board of Ghana), Zenith University College (ZUC) is a coeducational Ghanaian higher education institution. Zenith University College (ZUC) offers courses and programs leading to officially recognized higher education degrees such as bachelor degrees, master degrees in several areas of study. See the uniRank degree levels and areas of study matrix below for further details.  ZUC also provides several academic and non-academic facilities and services to students including a library,  as well as administrative services.", "acronym": "ZUC", "founded": "2001 ", "motto": "Per Ardua ad Astra Towards the stars", "colors": "\n\n ", "address": "La Education Centre, PO Box TF 511 Accra   Greater Accra Ghana", "tel": " +233 (302) 784 849", "fax": " +233 (302) 779 099"}]